---
kind: property
id: P:Autodesk.Revit.DB.Lighting.LightGroup.Id
source: html/5788fc2a-90cf-ee4d-2ed0-fd56844ec5fd.htm
---
# Autodesk.Revit.DB.Lighting.LightGroup.Id Property

The ElementId of the LightGroup

## Syntax (C#)
```csharp
public ElementId Id { get; }
```